{"podcast_details": {"podcast_title": "I missed me", "episode_title": "You are addicted to pain", "episode_image": "https://media.redcircle.com/images/2023/3/15/4/1173ae27-b243-46cb-97f8-ccc763e7d673_2a7c3b51b_29567345-1660963745557-9365bf3778a4d.jpg", "episode_transcript": " Whether you want a laid-back trail to hit with friends or you're planning something more adventurous, All Trails Plus is your guide to making the most of your time outdoors. Get outside today with three free months of All Trails Plus with Code Podcast 23 at alltrails.com Hey besties, welcome to I Missed Me. If this is your first time listening to I Missed Me, welcome. And if this is not your first time listening to I Missed Me, welcome back. I know, I know, I know, I know I've been absent. I know there hasn't been an episode in the past three weeks. I know and I'm sorry and I miss you and I love you, but these past three weeks have probably been the craziest weeks of my life. I took a little vacation with my whole family because I am starting college in like three days and I moved to my new apartment, which if you guys follow me on social media you have seen that I've been posting like vlogs and like moving in vlogs and whatever, but I just moved into my new apartment and I'm so excited and I can't wait to do a little like tour for you guys. So I went to Cancun with my family for like a week and I tried to stay very very away from social media just because I wanted to spend as much time as possible with them and then I came back and then I had to pack because I moved. It has just been like the most chaotic three weeks and I haven't had time to like sit down and like get my thoughts together and talk to you guys, which I apologize but like honestly it has been a very healthy break. I really do feel like I needed this time for myself so I'm very glad I took it. I am so sorry that you guys haven't gotten an episode and I have gotten so many DMs of you guys like asking me and telling me that you guys need an episode, but I also need it this time so I'm glad I took it, but I'm finally back. I finally had time to like build this studio in my new room. So I'm back besties, I'm so excited and I am so happy that I can finally sit down and talk to you guys again. With that being said, today we have a very good and interesting episode because just like you read in the title, you are addicted to pain. In this episode we're going to talk about pain and the reason why you can't ever seem to get rid of it. Now I want to start off by saying that nobody ever chooses to live with pain and it sounds very obvious but I do feel the need to clarify this before we get started but nobody would ever consciously decide to live in pain. However, some people and this might be your case never do anything about their pain or quote unquote give up on finding a solution and this might be maybe because it seems hard or it seems lonely or maybe you feel like it's taking forever to heal and just give up and just ultimately decide that it's just easier to live in pain than to figure out how to get rid of it because it's hard. But again and like I said, nobody consciously chooses to live in pain and this already is a very very big answer to your pain. You are living unconsciously. If consciously you wouldn't choose to be in pain then you must be living unconsciously. Now I'm talking about any type of emotional pain or heartache you might be feeling no matter the situation that you're going through. Heartbreak itself comes with a lot of emotions and there is absolutely no way around them and one of the biggest mistakes that we make when it comes to going through any type of heartbreak and I say any type of heartbreak because a lot of things and a lot of people and a lot of relationships and a lot of situations can break our heart and I know that romantic relationships are very common but heartbreak does come in many many forms. Going back to what I was saying, the biggest mistake that we make when we're going through heartbreak is to not go through it at all and trying to find every single way around it and around the emotions that it brings because of avoiding pain and every emotion that comes with it and I call this a mistake because the most common thing that we'll do when trying to avoid an emotion is to find the distraction. Now I want to talk about actions and distractions for a moment because it is very important to know the difference between these two before getting to my point. A distraction and by definition is an action that prevents someone from giving full attention to something else. Now an action is something that you have to give your full attention to in order for it to be done correctly. Actions and distractions are complete opposites and the only way you're going to be able to differentiate between whether you're doing an action or if it's just a distraction is your degree of presence while doing whatever it is that you're doing. The worst thing that you can ever do to yourself is to fight against your pain thinking that you'll win and thinking that by fighting against it or around it you will get rid of it and if you've done this in the past you are going to agree with me or realize that the only thing that you're doing when fighting against your pain is creating more pain because now you have the pain that was already there from the situation that you're going through and the pain being created while battling against yourself. Now with that being said if you can't get rid of pain by finding ways around it then the only option that we have left is to go through it. Our problem and going back to the reason why distractions are so common is that the mind ignores the present moment because it's unpredictable. The mind will always stick to the known and for our mind the unknown is very dangerous and that's why we always end up in the same type of situations because even though they might be painful they are familiar and that bestie and to start off our episode is the reason why you're addicted to pain because pain is familiar and whether you're conscious of it or not you know what to do when you are in pain. This was a very big realization even for me when I started to become a little bit more conscious about my patterns and my emotions and the way that I felt after a certain type of situation. I started noticing that certain relationships were causing me a lot of anxiety and somehow eventually took control of my emotions and made me feel a lot of pain and a lot of uncertainty but regardless of the way they were making me feel I still chose to keep those people in my life and I still chose to keep those relationships in my life. Again regardless of the amount of pain that I was going through and so eventually I decided to question myself and after listening to a lot of podcasts and after reading a lot of self-help books I started questioning myself and analyzing if this relationship or if this person or if these situations are making you feel so much pain why do you keep them in your life? Why do you keep allowing them? It sounds like the most obvious question and it also sounds like a very obvious answer to give like okay just let them go if they're causing you pain just let them go but as hard as I tried and as much as I wanted to let some people and some relationships go I couldn't and maybe I could for a few weeks or even a few months but somehow my mind always tricked me into finding a way to get those people back or to go back to those relationships and if you're relating to this and if you are stuck in a toxic cycle where obviously people are telling you to let it go and to just end it and that you deserve better and whatever like it sounds easy but it's not and the answer is obvious and we always know the healthiest answer for ourselves the hardest part is to like stick to our word and to what we know is right versus what our ego wants not even our heart because our heart will always want the healthiest thing for us but it is always connected to the ego but anyways that's a topic flavor is in full bloom at hello fresh enjoy the taste of spring with chef crafted recipes featuring ripe seasonal ingredients delivered right to your door hello fresh does more than just delicious dinners not only can you take your pick from 40 weekly recipes but you can choose from over 100 items to round out your order from snacks and easy lunches to desserts and pantry necessities everything arrives in one box on a delivery day you choose hosting a get together check out hello fresh market for crowd-pleasing appetizers snacks sites and more for your next gathering and the best part is that you can skip that extra trip to the grocery store and besties i don't know about you but my least favorite part about cooking is having to buy the ingredients hello fresh makes it easy fun and fast while having the healthiest meals at the same time which i love go to hello fresh.com slash mafiasude16 and use code mafiasude16 for 16 free meals plus free shipping 16 free meals besties that's insane with free shipping and again that's hellofresh.com slash mafiasude16 with code mafiasude16 for 16 free meals thank you so much hello fresh for sponsoring this episode as some of you may know besties i have a clothing brand a little while ago i had the idea that i wanted to sell hoodies with positive messages on the back i had no idea how to get started and that's why i'm so glad i found shopify shopify is a commerce platform revolutionizing millions of businesses worldwide whether you're a garage entrepreneur or ipo ready shopify is the only tool you need to start run and grow your business without the struggle shopify puts you in control of every sales channel so whether you're selling satin sheets from shopify's in-person pos system or offering organic olive oil on shopify's all-in-one e-commerce platform you're covered and once you've reached your audience shopify has the internet's best converting checkout to help you turn them from browsers to buyers what i love about shopify is that no matter how big you want to grow shopify gives you everything you need to take control and take your business to the next level shopify powers 10 percent of all e-commerce in the u.s shopify is truly a global force powering albert rothies and brooklyn and millions of other entrepreneurs of every size across 170 countries plus shopify's award-winning hope is there to support your success every step of the way this is possibility powered by shopify sign up for a one dollar per month trial period at shopify.com slash mafias all in lowercase go to shopify.com slash mafias to take your business to next level today that's shopify.com slash mafias for another episode my point being that i became addicted to my pain and i realized this when it was the same relationships that kept causing pain again and again and again and again and again i knew the answer was to let it go but somehow and whenever i tried to let go letting go felt harder as healthy as the decision was for my mental health it felt harder reason being and this might also be an answer to your problem is that our brain is wired for comfort and not happiness i have probably mentioned this in every single episode of i missed me but it is the answer to every single problem you might have your brain is wired for comfort and not happiness every single situation pattern or relationship that you have gotten used to will always be above everything else for your mind like i said our mind and our brain works in very fascinating ways and every single decision that it takes is ultimately for your safety for our mind the unknown is dangerous which means that if we choose the unknown in any single aspect of our lives if we choose the unknown our brain has to find new ways and new solutions and because again our brain is wired for comfort it will always prefer the known because it knows what to do for example if you are stuck in a toxic relationship and you can't seem to get out of it it is probably because your brain has gotten used to that toxic cycle where you fight and then you make up and then you block each other and then you don't follow each other and then you make up and everything is fine and then you fight again and then you ghost each other whatever the case may be your subconscious mind knows what is going to happen your subconscious mind knows that eventually you're going to fight and that eventually you're going to ghost each other and that eventually you're going to block each other and then eventually you're going to follow each other again and then eventually you're going to get back together your subconscious mind knows that and as unhealthy as it is and as much pain as it causes you you know what to do and you know what's going to happen now if you let that relationship go as good and as healthy as it would be for your mental health you wouldn't know what to do you don't know what living at peace feels like you don't know what living a happy life without a toxic relationship is like and again as as healthy or as happy as a life without a toxic relationship might be for your mind it is dangerous because again it's unknown and it doesn't know how to live in a healthy environment it doesn't know how to live in a happy environment it doesn't know how to live without anxiety or without depression or without a toxic relationship and because it doesn't know how a new life is going to be like then you will keep repeating patterns over and over again and even if that toxic relationship does end eventually your mind will do anything it takes to find someone that has the same qualities as that other toxic person that you were talking to because it knows what to do it knows how to deal with those type of people and with those type of relationships you probably have that one friend or maybe you're that one friend that is always in toxic cycles that always somehow ends up talking with the most toxic person out there that always gets involved in toxic relationships or in toxic situations your brain knows what to do now like i said in the beginning this can only happen if you're living unconsciously because consciously you would never choose that consciously you would choose and prioritize your happiness and your peace above anything else regardless of the amount of people that you have to let go now what does it mean to live consciously ultimately it just means that you learn how to live in the present moment you acknowledge and you accept that all you have is now that past situations and past relationships don't define you and that if you want your future to be different you have to make different decisions today now when i say the word conscious you know what i'm talking about we all have that very spiritual awakening part inside us that knows what living consciously is so i really don't have to explain it to you i just have to remind you that the reason why you're going through pain is because you're living unconsciously and again the only way that you're going to break your pain patterns is if you become conscious today if you start living in the present moment and if today you decide that you've went through enough you felt the pain that you had to feel and that if you want to stop living in pain you have to start making different decisions as hard as it's going to be for a little bit because your brain needs some time to get used to different decisions and different patterns and a different way of living if your brain is used to fighting all the time if your brain is used to feeling anxious about someone or about getting a text or about whatever it is if your brain is used to feeling anxious about a person then it is going to take some time for you to get used to not feeling anxious about anyone but again you have to be very very conscious and aware about the fact that it's not feeling uncomfortable and it's not feeling weird because it's unhealthy quite literally the opposite it's feeling uncomfortable because it's healthy and you're not used to living in a healthy and happy way and this is the only way your life is actually going to change if you are finally brave enough to encounter uncomfortability for your well-being and for your mental health and as lonely as it might feel for a little bit of time the only thing that you're going to do is elevate your frequency so that when you're in the healthiest and happiest place you can ever be and when you're the best version of yourself you're going to start attracting people that are vibrating in your same frequency and that will only happen if you allow yourself to make different decisions and just like any other addiction getting rid of pain is hard and it's going to take some time and this is where you have to be mentally the strongest and keep reminding yourself like i am breaking toxic patterns i am breaking toxic patterns and i am so used to pain that that's the only reason why it feels uncomfortable but this is the best decision for me until happiness and until peace and until healthy relationships and situations are what feel comfortable to your brain and that's the only thing you start attracting and that's it for today's episode besties i love you guys with my whole entire heart i missed you so much i missed this so much i'm finally getting my life back together again i start classes next week and i'm going to make a schedule for me to record also don't forget i have a clothing brand no name project the cutest brown hoodie that says we're all strangers healing together on the back if you do get one please send me pictures i would love to post you and i would love to see you wearing it don't forget to follow me on social media at mafias what is on tiktok on instagram on youtube literally everywhere at i missed me podcast on youtube on instagram on tiktok also everywhere and my clothing brand is at no name project co on instagram at no name project co on tiktok no name project dot co is the website if you guys want to check the hoodies out i would really really appreciate it but for today that's it i love you guys and i will see you on tuesday with love mafi a nature trail is more than a path it's a place for laughter self-reflection and a breath of fresh air all trails plus helps you plan your next hike so you can relax and enjoy the journey discover new trails near you with the distance away feature and get immersive trail previews and offline maps so you can take those exciting first steps with confidence get outside today with three free months of all trails plus just use code podcast 23 at alltrails.com slash podcast that's three months free at alltrails.com slash podcast with code podcast 23"}, "podcast_summary": "Summary:\n\nIn this podcast episode titled \"You Are Addicted to Pain,\" the host discusses the concept of living unconsciously and how it leads to people staying in pain or toxic situations. The host emphasizes that nobody consciously chooses to live in pain, but some may give up on finding a solution or feel that it's easier to stay in pain. The episode encourages listeners to go through the pain instead of trying to avoid it through distractions. The host explains that distractions are actions that prevent someone from fully focusing, while actions require full attention. The podcast suggests that going through the pain is the only way to overcome it and break free from toxic patterns. It also points out that the brain is wired for comfort rather than happiness, causing people to stick to familiar, even if painful, situations. The host urges listeners to live consciously, in the present moment, and make different decisions to break free from pain and attract healthier situations and relationships. The episode concludes by emphasizing that breaking the addiction to pain takes time and mental strength but ultimately leads to happiness and peace. The host also mentions their clothing brand, \"No Name Project,\" and encourages listeners to check it out. The podcast episode is sponsored by HelloFresh, Shopify, and AllTrails Plus.\n\nNote: The summary has been edited for clarity and conciseness.", "podcast_guest": {"name": "I Missed Me", "org": "All Trails Plus", "title": null}, "podcast_highlights": "- Highlight 1: \"Nobody ever chooses to live with pain...but some people never do anything about their pain or give up on finding a solution...\"\n- Highlight 2: \"The most common thing we'll do when trying to avoid an emotion is to find the distraction...\"\n- Highlight 3: \"The worst thing that you can ever do to yourself is to fight against your pain thinking that you'll win...creating more pain because now you have the pain that was already there and the pain being created while battling against yourself...\"\n- Highlight 4: \"As hard as I tried and as much as I wanted to let some people and some relationships go, I couldn't...my mind always tricked me into finding a way to go back to those relationships...\"\n- Highlight 5: \"Your brain is wired for comfort and not happiness...every single situation, pattern, or relationship that you have gotten used to will always be above everything else for your mind...\""}